{
  "format": "layers-model",
  "generatedBy": "keras v2.3.0-tf",
  "convertedBy": "TensorFlow.js Converter v1.7.4r1",
  "modelTopology": {
    "keras_version": "2.3.0-tf",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Model",
      "config": {
        "name": "model_2",
        "layers": [
          {
            "class_name": "InputLayer",
            "config": {
              "batch_input_shape": [null, null],
              "dtype": "float32",
              "sparse": false,
              "ragged": false,
              "name": "input_2"
            },
            "name": "input_2",
            "inbound_nodes": []
          },
          {
            "class_name": "Embedding",
            "config": {
              "name": "embedding_1",
              "trainable": true,
              "batch_input_shape": [null, null],
              "dtype": "float32",
              "input_dim": 10000,
              "output_dim": 10,
              "embeddings_initializer": {
                "class_name": "RandomUniform",
                "config": { "minval": -0.05, "maxval": 0.05, "seed": null }
              },
              "embeddings_regularizer": null,
              "activity_regularizer": null,
              "embeddings_constraint": null,
              "mask_zero": false,
              "input_length": null
            },
            "name": "embedding_1",
            "inbound_nodes": [[["input_2", 0, 0, {}]]]
          },
          {
            "class_name": "InputLayer",
            "config": {
              "batch_input_shape": [null, 256],
              "dtype": "float32",
              "sparse": false,
              "ragged": false,
              "name": "input_3"
            },
            "name": "input_3",
            "inbound_nodes": []
          },
          {
            "class_name": "GRU",
            "config": {
              "name": "gru_1",
              "trainable": true,
              "dtype": "float32",
              "return_sequences": true,
              "return_state": true,
              "go_backwards": false,
              "stateful": false,
              "unroll": false,
              "time_major": false,
              "units": 256,
              "activation": "tanh",
              "recurrent_activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": { "seed": null }
              },
              "recurrent_initializer": {
                "class_name": "Orthogonal",
                "config": { "gain": 1.0, "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "recurrent_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "recurrent_constraint": null,
              "bias_constraint": null,
              "dropout": 0.0,
              "recurrent_dropout": 0.0,
              "implementation": 2,
              "reset_after": false
            },
            "name": "gru_1",
            "inbound_nodes": [
              [
                ["embedding_1", 0, 0, {}],
                ["input_3", 0, 0, {}]
              ]
            ]
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense",
              "trainable": true,
              "dtype": "float32",
              "units": 128,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": { "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "dense",
            "inbound_nodes": [[["gru_1", 0, 0, {}]]]
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_1",
              "trainable": true,
              "dtype": "float32",
              "units": 10000,
              "activation": "softmax",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": { "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "dense_1",
            "inbound_nodes": [[["dense", 0, 0, {}]]]
          }
        ],
        "input_layers": [
          ["input_2", 0, 0],
          ["input_3", 0, 0]
        ],
        "output_layers": [
          ["dense_1", 0, 0],
          ["gru_1", 0, 1]
        ]
      }
    }
  },
  "weightsManifest": [
    {
      "paths": ["group1-shard1of2.bin", "group1-shard2of2.bin"],
      "weights": [
        { "name": "dense/kernel", "shape": [256, 128], "dtype": "float32" },
        { "name": "dense/bias", "shape": [128], "dtype": "float32" },
        { "name": "dense_1/kernel", "shape": [128, 10000], "dtype": "float32" },
        { "name": "dense_1/bias", "shape": [10000], "dtype": "float32" },
        {
          "name": "embedding_1/embeddings",
          "shape": [10000, 10],
          "dtype": "float32"
        },
        {
          "name": "gru_1/gru_cell_3/kernel",
          "shape": [10, 768],
          "dtype": "float32"
        },
        {
          "name": "gru_1/gru_cell_3/recurrent_kernel",
          "shape": [256, 768],
          "dtype": "float32"
        },
        {
          "name": "gru_1/gru_cell_3/bias",
          "shape": [2, 768],
          "dtype": "float32"
        }
      ]
    }
  ]
}
